Repository: marcosjunqueira/sonar-l10n-pt-omegat
Catalog: tm/core-omegat.tmx
Source language: en_us
Languages: pt_br

source: Unknown task group
pt_br: Grupo de tarefas desconhecido

source: Unknown
pt_br: Desconhecido

source: Task List
pt_br: Lista de tarefas

source: Provides API for Task List plugins that can show various issues (Java errors, warnings, TODOs) in Task List window
pt_br: Fornece a API para plugins da lista de tarefas que pode exibir vários problemas (erros do Java, avisos, TODOs) na janela lista de tarefas

source: Task List API
pt_br: API da lista de tarefas

source: Unknown Task group name: {0}
pt_br: Nome do grupo de tarefas desconhecido: {0}

source: Provides API for Task List plugins
pt_br: Fornece a API para plugins da lista de tarefas

source: Provides the Task List window, which lists places of interest in your project, such as lines that contain "TODO", "XXX", "PENDING", Java compilation errors, and so on.
pt_br: Fornece a janela lista de tarefas, a qual lista locais de interesse em seu projeto, tais como linhas que contém "TODO", "XXX", "PENDING", erros de compilação Java, etc.

source: You can click an entry in the list to navigate to the corresponding place in your code.
pt_br: Você pode clicar em uma entrada na lista para navegar até o local correspondente em seu código.

source: Panel where you can set filters on the list
pt_br: Painel onde é possível definir filtros na lista

source: Condition List
pt_br: Lista de condições

source: Filter the list by the following criteria
pt_br: Filtrar a lista pelos seguintes critérios

source: Property
pt_br: Propriedade

source: Property to apply criterion to
pt_br: Aplicar critério de propriedade para

source: Relation
pt_br: Relação

source: Comparator to check the property with
pt_br: Comparador para verificar a propriedade com

source: Value
pt_br: Valor

source: Value to compare property with
pt_br: Valor para comparar a propriedade com

source: Equals
pt_br: Igual

source: Not equals
pt_br: Diferente

source: Contains
pt_br: Contém

source: Does not contain
pt_br: Não contém

source: Begins with
pt_br: Começa com

source: Ends with
pt_br: Termina com

source: Less than
pt_br: Menor que

source: Less than or equals
pt_br: Menor ou igual a

source: Greater than
pt_br: Maior que

source: Greater than or equals
pt_br: Maior ou igual a

source: Earlier than
pt_br: Antes de

source: Later than
pt_br: Depois de

source: Is true
pt_br: É verdadeiro

source: Is false
pt_br: É falso

source: Equals (Case Sensitive)
pt_br: Igual (Distinção de maiúsculas/minúsculas)

source: Contains (Case Sensitive)
pt_br: Contém (Distinção de maiúsculas/minúsculas)

source: Does not contain (Case Sensitive)
pt_br: Não contém (Distinção de maiúsculas/minúsculas)

source: Begins with (Case Sensitive)
pt_br: Começa com (Distinção de maiúsculas/minúsculas)

source: Ends with (Case Sensitive)
pt_br: Termina com (Distinção de maiúsculas/minúsculas)

source: Is today
pt_br: É hoje

source: Is undefined
pt_br: Não está definido

source: Is one of
pt_br: É um de

source: No Filter
pt_br: Sem filtro

source: Textual condition value
pt_br: Valor textual da condição

source: Task Group condition value
pt_br: Valor do grupo de tarefas da condição

source: Filter&s:
pt_br: Filtro&s:

source: List of all filters
pt_br: Lista de todos os filtros

source: Confirm changes
pt_br: Confirmar alterações

source: Apply changes
pt_br: Aplicar alterações

source: Cancel changes
pt_br: Cancelar alterações

source: Choose priority
pt_br: Escolher prioridade

source: Conditions
pt_br: Condições

source: List of conditions that filter the tasks
pt_br: Lista de condições que filtram as tarefas

source: Filters
pt_br: Filtros

source: Ne&w
pt_br: No&vo

source: Create a new filter
pt_br: Criar um novo filtro

source: &Delete
pt_br: E&xcluir

source: Delete the selected filter
pt_br: Apagar o filtro selecionado

source: Category
pt_br: Categoria

source: File
pt_br: Arquivo

source: Location
pt_br: Localização

source: Description
pt_br: Descrição

source: &New
pt_br: &Novo

source: &Remove
pt_br: &Remover

source: N&ame:
pt_br: N&ome:

source: Keywords
pt_br: Palavras-chave

source: Apply filter if all conditions are true
pt_br: Aplicar filtro se todas as condições forem verdadeiras

source: Apply filter if at least one condition is true
pt_br: Aplicar filtro se pelo menos uma condição for verdadeira

source: Add more conditions to the list of filters
pt_br: Adicionar mais condições à lista de filtros

source: Remove last condition to the list of filters
pt_br: Remover a última condição da lista de filtros

source: Match a&ll of the following
pt_br: Verificar correspondência de &todos os seguintes

source: Match an&y of the following
pt_br: Verificar correspondência de &qualquer um dos seguintes

source: &More
pt_br: &Mais

source: &Fewer
pt_br: Al&guns

source: Create new filter
pt_br: Criar novo filtro

source: Remove the selected filter
pt_br: Remover filtro selecionado

source: Name of the filter
pt_br: Nome do filtro

source: &Options
pt_br: &Opções

source: &Limit visible items per type to:
pt_br: &Limite de itens visíveis por tipo para:

source: Types
pt_br: Tipos

source: Task List Filter
pt_br: Filtro da lista de tarefas

source: New Filter
pt_br: Novo filtro

source: Default Filter
pt_br: Filtro padrão

source: This is a Task List window
pt_br: Esta é uma janela de lista de tarefas

source: Task List UI
pt_br: Lista de tarefas UI

source: Edit...
pt_br: Editar...

source: Click here to select a filter
pt_br: Clique aqui para selecionar um filtro

source: Line
pt_br: Linha

source: Next Task
pt_br: Próxima tarefa

source: Previous Task
pt_br: Tarefa anterior

source: Display tasks as list
pt_br: Exibir tarefas como lista

source: Group tasks by category
pt_br: Agrupar tarefas por categoria

source: Scope
pt_br: Escopo

source: Filter
pt_br: Filtro

source: Sort by
pt_br: Ordenar por

source: Refresh
pt_br: Atualizar

source: Ascending
pt_br: Ascendente

source: Descending
pt_br: Descendente

source: Show All
pt_br: Exibir todos

source: Task scanning
pt_br: Pesquisando tarefas

source: Task List window implementation
pt_br: Implementação da janela de lista de tarefas

source: Error
pt_br: Erro

source: Errors and important problems
pt_br: Erros e problemas importantes

source: Warning
pt_br: Aviso

source: Warning and problems that can be ignored
pt_br: Problemas e avisos que podem ser ignorados

source: Current File
pt_br: Arquivo atual

source: Show tasks for currently edited file only
pt_br: Exibir tarefas somente para arquivos editados atualmente

source: Show Source
pt_br: Exibir código-fonte

source: Scan for ToDo items in source file comments, each item is displayed in Task List window
pt_br: Pesquisar por itens ToDo em comentários do código-fonte, cada item é mostrado na janela lista de tarefas

source: ToDo Task Scanner
pt_br: Pesquisar tarefas ToDo

source: User TODO tasks from source file comments
pt_br: Tarefas TODO do usuário a partir de comentários do código-fonte

source: Scan for ToDo items in source file comments
pt_br: Pesquisar por itens ToDo em comentários do código-fonte

source: &Show ToDos from comments only
pt_br: Exibir ToDo&s apenas a partir de comentários

source: ToDo &Patterns:
pt_br: &Padrões ToDo:

source: <enter pattern here>
pt_br: <entre com seu padrão aqui>

source: &Add
pt_br: &Adicionar

source: &Edit
pt_br: E&ditar

source: ToDo Tasks
pt_br: Tarefas ToDo

source: Options for ToDo tasks in Task List window.
pt_br: Opções para tarefas ToDo na janela lista de tarefas.

source: Look & Feel Customization Library
pt_br: Biblioteca de personalização de aparência & funcionalidade

source: Infrastructure
pt_br: Infra-estrutura

source: Handles per-look-and-feel UIManager customizations for NetBeans
pt_br: Controla personalizações do UIManager, por aparência e personalidade, para o NetBeans

source: Defines NetBeans-specific values needed in UIManager and ensures that some values available in BasicLookAndFeel are available on all look and feels.
pt_br: Define valores específicos do NetBeans que são necessários no UIManager e garantem que alguns valores disponíveis no BasicLookAndFeel estejam disponíveis em todas as aparências e funcionalidades.

source: Handles metal-theme support, look and feel selection and initializing custom font sizes
pt_br: Controla o suporte para o tema Metal, seleção de aparência e funcionalidade e inicialização dos tamanhos personalizados de fontes

source: Warning: Due to JDK bug 5079742, fonts in NetBeans will not look good.
pt_br: Aviso: De acordo com o bug do JDK 5079742, as fontes no NetBeans não terão boa aparência.

source: Please install JDK 1.5.0_02 or newer, details at http://bugs.sun.com/bugdatabase/view_bug.do?bug_id=5079742
pt_br: Por favor instale o JDK 1.5.0_02 ou superior, veja detalhes em http://bugs.sun.com/bugdatabase/view_bug.do?bug_id=5079742

source: Directory Chooser
pt_br: Seletor de diretório

source: Replaces regular Swing file chooser in directory-only mode.
pt_br: Substitui o seletor de arquivo Swing regular no modo somente diretório.

source: Replaces regular Swing file chooser in directory-only mode with an enhanced UI.
pt_br: Substitui o seletor de arquivo Swing regular no modo somente diretório com uma UI melhorada.

source: New Folder
pt_br: Nova pasta

source: Rename
pt_br: Renomear

source: Delete
pt_br: Excluir

source: Are you sure you want to delete {0}?
pt_br: Tem certeza que deseja excluir {0}?

source: Are you sure you want to delete these {0} items?
pt_br: Tem certeza que deseja excluir estes {0} itens?

source: Files cannot be deleted.
pt_br: Os arquivos não puderam ser excluídos.

source: File cannot be deleted.
pt_br: O arquivo não pôde ser excluído.

source: Please Confirm
pt_br: Por favor, confirme

source: Tab Control
pt_br: Controle de abas

source: Libraries
pt_br: Bibliotecas

source: The tab control used by the window system
pt_br: O controle de abas usado pelo sistema de janelas

source: The NetBeans windowing system's tab control bean library
pt_br: A biblioteca de beans de controle de abas do sistema de janelas do NetBeans

source: Tab control to switch between tabs.
pt_br: Controle de aba para navegar pelas abas.

source: Show Opened Documents List
pt_br: Exibir lista de documentos abertos

source: Restore Window
pt_br: Restaurar janela

source: Maximize Window
pt_br: Maximizar janela

source: Minimize Window
pt_br: Minimizar janela

source: Close Window
pt_br: Fechar janela

source: Scroll Documents Right
pt_br: Rolar documentos à direita

source: Scroll Documents Left
pt_br: Rolar documentos à esquerda

source: Palette
pt_br: Paleta

source: Palette Category
pt_br: Categoria de paleta

source: New Palette Category
pt_br: Nova categoria de paleta

source: &New Category Name:
pt_br: &Nome da nova categoria:

source: Component Palette
pt_br: Paleta de componentes

source: Cut
pt_br: Recortar

source: Copy
pt_br: Copiar

source: Remove
pt_br: Remover

source: Are you sure you want to remove "{0}" item from the palette?
pt_br: Realmente deseja remover o item "{0}" da paleta?

source: Confirm Palette Item Removal
pt_br: Confirmar exclusão do item da paleta

source: Show Item Names
pt_br: Exibir nomes dos itens

source: Hide Item Names
pt_br: Ocultar nomes dos itens

source: Show {0,choice,1#Big|2#Small} Icons
pt_br: Exibir ícones {0,choice,1#grandes|2#pequenos}

source: Change Items Order
pt_br: Alterar a ordem dos itens

source: Sort by Item Name
pt_br: Ordenar por nome do item

source: Paste Item
pt_br: Colar item

source: Delete Category
pt_br: Excluir categoria

source: Rename Category
pt_br: Renomear categoria

source: Are you sure you want to delete "{0}" palette category and all of its contents?
pt_br: Tem certeza de que deseja excluir a categoria de paleta "{0}" e todo o seu conteúdo?

source: Confirm Palette Category Removal
pt_br: Confirmar exclusão de categoria de Paleta

source: &New Name:
pt_br: &Novo nome:

source: Sort by Category Name
pt_br: Ordenar por nome de categoria

source: Change Categories Order
pt_br: Alterar a ordem das categorias

source: Create New Category
pt_br: Criar nova categoria

source: Refresh Palette
pt_br: Atualizar paleta

source: {0} is not a valid name.
pt_br: {0} não é um nome válido.

source: Palette category "{0}" already exists.
pt_br: A categoria de paleta "{0}" já existe.

source: Palette Manager
pt_br: Gerenciador de paleta

source: Pale&tte Content:
pt_br: Conteúdo da pale&ta:

source: &New Category...
pt_br: &Nova categoria...

source: &Remove...
pt_br: Exclui&r...

source: Move &Up
pt_br: Mover para &cima

source: Move &Down
pt_br: Move para &baixo

source: &Close
pt_br: &Fechar

source: Are you sure you to remove the selected content from the palette?
pt_br: Tem certeza de que deseja excluir da paleta o conteúdo selecionado?

source: Confirm Palette Content Removal
pt_br: Confirmar exclusão de conteúdo da Paleta

source: Move selected item or category up
pt_br: Move para cima o item ou categoria selecionado

source: Move selected item or category down
pt_br: Move para baixo o item ou categoria selecinado

source: Remove selected item or category
pt_br: Exclui o item ou categoria selecionado

source: Add new category
pt_br: Adicionar nova categoria

source: Close Palette Manager window
pt_br: Fechar janela do gerenciador de paleta

source: Palette Contents Tree
pt_br: Árvore de conteúdo da paleta

source: Palette categories and items displayed as a tree
pt_br: Itens e categorias de paleta exibidos como árvore

source: Reset &Palette
pt_br: Redefinir &paleta

source: Reset Palette Button
pt_br: Botão redefinir paleta

source: Resets the component palette to its default state
pt_br: Redefinir os componentes de paleta para seu estado padrão

source: Reset Palette
pt_br: Redefinir paleta

source: Are you sure you want to reset the palette?
pt_br: Tem certeza de que deseja redefinir a paleta?

source: Confirm Palette Reset
pt_br: Confirmar redefinição de paleta

source: Palette Manager...
pt_br: Gerenciador de paleta...

source: Pale&tte
pt_br: Pale&ta

source: Unknown editor palette item version.
pt_br: Versão do item de paleta de edição desconhecida.

source: Unsupported editor palette item version.
pt_br: Versão do item de paleta de edição não suportada.

source: Error while saving palette settings.
pt_br: Erro enquanto salvava as configurações da paleta.

source: Common Palette
pt_br: Paleta padrão

source: Common Palette visualization and APIs
pt_br: APIs e visualização padrão de paletas

source: &Palette
pt_br: &Paleta

source: Valid
pt_br: Válido

source: If True, this filesystem is valid and usable.
pt_br: Se marcado, este sistema de arquivos é válido e usável.

source: Indentation Engines
pt_br: Mecanismos de indentação

source: All types of indentation engines registered in the system.
pt_br: Todos os tipos de mecanismos de indentação registrados no sistema.

source: No Indentation
pt_br: Sem indentação

source: Identifying Name
pt_br: Nome identificador

source: A unique name for this service that will identify it to the system and to you.
pt_br: Um nome único que irá identificar este serviço para você e para o sistema.

source: Representation Class
pt_br: Classe de representação

source: Representation class of this loader; only useful for writing modules.
pt_br: Classe de representação para este carregador. Útil apenas para criar módulos.

source: Actions
pt_br: Ações

source: Actions used by default in the contextual menu for objects of this type.
pt_br: Ações usadas, por padrão, nos menus de contexto para objetos deste tipo.

source: Extensions and MIME Types
pt_br: Tipos MIME e extensões

source: Extensions or MIME Types recognized as belonging to this type of object (extensions without the dot).
pt_br: Tipos MIME ou extensões reconhecidas como pertencentes a este tipo de objeto (extensões sem o ponto).

source: Add &Separator
pt_br: Adicionar &separador

source: Move Do&wn
pt_br: Mover para &baixo

source: Adds an action from the actions pool to the end of the list.
pt_br: Adiciona uma ação do pool de ações para o fim da lista.

source: Adds a separator to the end of the list.
pt_br: Adiciona um separador ao fim da lista.

source: Removes the selected action from the list.
pt_br: Exclui da lista a ação selecionada.

source: Moves the selected item up in the list.
pt_br: Move o item selecionado para cima na lista.

source: Moves the selected item down in the list.
pt_br: Move o item selecionado para baixo na lista.

source: Actions pool
pt_br: Pool de ações

source: Actions list
pt_br: Lista de ações

source: <unnamed action>
pt_br: <ação sem nome>

source: Swing HTML Browser
pt_br: Navegador HTML do swing

source: Simple HTML Browser based on Swing component
pt_br: Navegador HTML simples baseado em componente Swing

source: Browser Description
pt_br: Descrição do navegador

source: Description of HTML browser
pt_br: Descrição do navegador HTML

source: The size cannot be negative
pt_br: O tamanho não pode ser negativo

source: Invalid value entered
pt_br: O valor informado é inválido

source: Value of {0} should be in format {1}
pt_br: O valor da {0} deve estar no formato {1}

source: AWT Palette
pt_br: Paleta AWT

source: Swing Palette
pt_br: Paleta Swing

source: System Palette
pt_br: Paleta do sistema

source: "{0}" is not a valid color identifier.
pt_br: "{0}" não é um identificador de cor válido.

source: You may enter Swing or AWT constants or red/green/blue values.
pt_br: Você pode entrar com constantes Swing ou AWT, ou com valores RGB.

source: white
pt_br: branco

source: lightGray
pt_br: cinzaClaro

source: gray
pt_br: cinza

source: darkGray
pt_br: cinzaEscuro

source: black
pt_br: preto

source: red
pt_br: vermelho

source: pink
pt_br: rosa

source: orange
pt_br: laranja

source: yellow
pt_br: amarelo

source: green
pt_br: verde

source: magenta
pt_br: violeta

source: cyan
pt_br: azulClaro

source: blue
pt_br: azul

source: Active Caption
pt_br: Legenda ativa

source: Active Caption Border
pt_br: Borda de legenda ativa

source: Active Caption Text
pt_br: Texto de legenda ativa

source: Control
pt_br: Controle

source: Control Dk Shadow
pt_br: Sombreado do controle

source: Control Highlight
pt_br: Realce do controle

source: Control Lt Highlight
pt_br: Realce leve do controle

source: Control Shadow
pt_br: Sombra do controle

source: Control Text
pt_br: Texto do controle

source: Desktop
pt_br: Área de trabalho

source: Inactive Caption
pt_br: Legenda inativa

source: Inactive Caption Border
pt_br: Borda de legenda inativa

source: Inactive Caption Text
pt_br: Texto de legenda inativa

source: Info
pt_br: Informação

source: Info Text
pt_br: Texto informativo

source: Menu Text
pt_br: Texto de menu

source: Scrollbar
pt_br: Barra de rolagem

source: Text
pt_br: Texto

source: Text Highlight
pt_br: Realce do texto

source: Text Highlight Text
pt_br: Texto de realce do texto

source: Text Inactive Text
pt_br: Texto de inatividade do texto

source: Text Text
pt_br: Texto do texto

source: Window
pt_br: Janela

source: Window Border
pt_br: Borda da janela

source: Window Text
pt_br: Texto da janela

source: Dimension
pt_br: Dimensão

source: &Width:
pt_br: &Largura:

source: &Height:
pt_br: &Altura:

source: [width,height]
pt_br: [largura,altura]

source: Plain
pt_br: Normal

source: Bold
pt_br: Negrito

source: Italic
pt_br: Itálico

source: Bold Italic
pt_br: Negrito e itálico

source: Fon&t:
pt_br: Fon&te:

source: Font St&yle:
pt_br: Est&ilo de fonte:

source: &Size:
pt_br: Taman&ho:

source: Preview
pt_br: Visualização

source: Insets
pt_br: Suplementos

source: &Top:
pt_br: &Superior:

source: &Left:
pt_br: &Esquerda:

source: &Bottom:
pt_br: &Inferior:

source: &Right:
pt_br: &Direita:

source: [top,left,bottom,right]
pt_br: [superior,esquerda,inferior,direita]

source: <Lookup null value>
pt_br: <Pesquise valor nulo>

source: <Lookup null item>
pt_br: <Pesquise item nulo>

source: Point
pt_br: Ponto

source: Rectangle
pt_br: Retângulo

source: [x,y,width,height]
pt_br: [x,y,largura,altura]

source: Text:
pt_br: Texto:

source: Enter the property text here
pt_br: Digite aqui o texto da propriedade

source: Editor for string properties
pt_br: Editor para propriedades de texto

source: Instructions
pt_br: Instruções

source: Default
pt_br: Padrão

source: Choose and Configure Indentation Engine
pt_br: Escolha e configure o mecanismo de indentação

source: Choose and Configure Service Type
pt_br: Escolha e configura o tipo de serviço

source: Storing to XML failed because the value of font is not initialized.
pt_br: Houve uma falha ao gravar no XML porque o valor da fonte não foi inicializado.

source: Select Package
pt_br: Selecionar pacote

source: &Target Location
pt_br: &Local de destino

source: F&older:
pt_br: &Pasta:

source: &Directory:
pt_br: &Diretório:

source: Target Location
pt_br: Local de destino

source: &Create
pt_br: &Criar

source: Select a File or Directory
pt_br: Selecione um arquivo ou diretório

source: Select a File
pt_br: Selecione um arquivo

source: Select a Directory
pt_br: Selecione um diretório

source: <Unspecified>
pt_br: <Não especificado>

source: Properties
pt_br: Propriedades

source: Warning: comments will be discarded.
pt_br: Aviso: comentários serão descartados.

source: <empty>
pt_br: <vazio>

source: Item &List
pt_br: &Lista de itens

source: &Up
pt_br: Para &cima

source: Do&wn
pt_br: Para &baixo

source: true
pt_br: verdadeiro

source: false
pt_br: falso

source: null
pt_br: nulo

source: Non integer input value:
pt_br: Valor de entrada não-inteiro:

source: Illegal string kmsgey "
pt_br: Texto inválido kmsgey "

source: " - valid values are: "
pt_br: " - valores válidos são: "

source: Unknown class: {0}
pt_br: Classe desconhecida: {0}

source: Not a legal value: {0}
pt_br: Não é um valor correto: {0}

source: Not a recognized URL: {0}
pt_br: Não é uma URL reconhecida: {0}

source: Null, or an empty array
pt_br: Nulo ou array vazio

source: Unknown folder:{0}
pt_br: Pasta desconhecida: {0}

source: Available options
pt_br: Opções disponíveis

source: Select an object
pt_br: Selecionar um objeto

source: If you are seeing this message, an error occured while initializing the list of available fonts.
pt_br: Se você está vendo esta mensagem, um erro ocorreu ao inicializar a lista de fontes disponíveis.

source: This is due to a bug in the Apple JVM triggered when bitmap fonts are installed on the system.
pt_br: Isto é devido a uma falha na JVM da Apple, ocasionado quando fontes de mapas de bits são instaladas no sistema.

source: In order to use the font editor, you will need to uninstall all bitmap fonts on your system.
pt_br: Para poder usar o editor de fontes, você deverá desinstalar todas as fontes de mapas de bits em seu sistema.

source: See Apple BugReporter issue 3121780 for further details.
pt_br: Veja o item de relatório de erros da Apple, número 3121780, para maiores detalhes.

source: Core
pt_br: Núcleo

source: The basic framework of NetBeans-based applications.
pt_br: A estrutura básica das aplicações baseadas no NetBeans.

source: This module provides the central infrastructure that lets NetBeans-based applications run.
pt_br: Este módulo fornece a infra-estrutura central que possibilita a execução de aplicações baseadas no NetBeans.

source: It cannot be disabled.
pt_br: Não pode ser desabilitado.

source: All Files
pt_br: Todos os arquivos

source: Folders and files used for development.
pt_br: Pastas e arquivos usados para desenvolvimento.

source: Provides access to all available actions.
pt_br: Fornece acesso para todas as ações disponíveis.

source: System Settings
pt_br: Configurações de sistema

source: Show Tool Tips In IDE
pt_br: Exibir dicas de ferramentas no IDE

source: If True, Tool Tips are displayed in the IDE.
pt_br: Se verdadeiro, dicas de ferramentas serão exibidas no IDE.

source: Confirm Delete
pt_br: Confirmar exclusão
